O2/DataProcessors/ГенераторЗаказовПроизводства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<DataProcessor>
		<Properties>
			<Name>ГенераторЗаказовПроизводства</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЗаказов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоСозданиеЗакупки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоСозданиеВыпуска</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТЧРезультат</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерЗаказа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаЗаказа</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Изделие</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

O2/DataProcessors/ГенераторЗаказовПроизводства/Forms/Форма/Ext/Form/Module.bsl
// Модуль формы обработки ГенераторЗаказовПроизводства

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Устанавливаем значения по умолчанию
	Объект.ДатаНачала = ТекущаяДата();
	Объект.ДатаОкончания = ДобавитьМесяц(ТекущаяДата(), 1);
	Объект.КоличествоЗаказов = 10;
	Объект.АвтоСозданиеЗакупки = Истина;
	Объект.АвтоСозданиеВыпуска = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СгенерироватьЗаказы(Команда)
	// Проверка ввода
	Если Объект.КоличествоЗаказов <= 0 ИЛИ Объект.КоличествоЗаказов > 100 Тогда
		Сообщить("Количество заказов должно быть от 1 до 100");
		Возврат;
	КонецЕсли;
	
	Если Объект.ДатаНачала > Объект.ДатаОкончания Тогда
		Сообщить("Дата начала не может быть больше даты окончания");
		Возврат;
	КонецЕсли;
	
	Попытка
		// Очищаем таблицу результатов
		Объект.ТЧРезультат.Очистить();
		
		// Генерируем заказы
		СгенерироватьЗаказыНаСервере();
		
		Сообщить("Генерация заказов завершена");
	Исключение
		Сообщить("Ошибка: " + ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

&НаСервере
Процедура СгенерироватьЗаказыНаСервере()
	// Получаем все изделия с активными спецификациями
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|   Номенклатура.Ссылка КАК Изделие,
	|   Номенклатура.Наименование КАК Наименование,
	|   Спецификации.Ссылка КАК Спецификация
	|ИЗ
	|   Справочник.Номенклатура КАК Номенклатура
	|       ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Спецификации КАК Спецификации
	|       ПО Номенклатура.Ссылка = Спецификации.Выходное_изделие
	|           И Спецификации.Статус = &СтатусАктивная
	|ГДЕ
	|   Номенклатура.Тип = &ТипГотоваяПродукция
	|   И НЕ Номенклатура.ПометкаУдаления
	|   И Спецификации.Ссылка ЕСТЬ НЕ NULL";
	
	Запрос.УстановитьПараметр("СтатусАктивная", Перечисления.Статус.Активная);
	Запрос.УстановитьПараметр("ТипГотоваяПродукция", Перечисления.Тип.Готовая_продукция);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	// Собираем доступные изделия в массив
	ДоступныеИзделия = Новый Массив;
	Пока Выборка.Следующий() Цикл
		СтруктураИзделия = Новый Структура;
		СтруктураИзделия.Вставить("Изделие", Выборка.Изделие);
		СтруктураИзделия.Вставить("Наименование", Выборка.Наименование);
		СтруктураИзделия.Вставить("Спецификация", Выборка.Спецификация);
		ДоступныеИзделия.Добавить(СтруктураИзделия);
	КонецЦикла;
	
	Если ДоступныеИзделия.Количество() = 0 Тогда
		Сообщить("Нет доступных изделий с активными спецификациями");
		Возврат;
	КонецЕсли;
	
	// Инициализируем генератор случайных чисел
	ГСЧ = Новый ГенераторСлучайныхЧисел();
	
	// Создаем массив для хранения созданных заказов
	СозданныеЗаказы = Новый Массив;
	
	// Генерируем заказы
	Для Счетчик = 1 По Объект.КоличествоЗаказов Цикл
		// Случайная дата в заданном диапазоне
		ДнейВДиапазоне = (Объект.ДатаОкончания - Объект.ДатаНачала) / 86400;
		СлучайныйДень = Объект.ДатаНачала + 86400 * ГСЧ.СлучайноеЧисло(0, ДнейВДиапазоне - 1);
		
		// Случайное изделие
		ИндексИзделия = ГСЧ.СлучайноеЧисло(0, ДоступныеИзделия.Количество() - 1);
		ВыбранноеИзделие = ДоступныеИзделия[ИндексИзделия];
		
		// Случайное количество (1-100)
		КоличествоИзделий = ГСЧ.СлучайноеЧисло(1, 100);
		
		// Создаем заказ
		СозданныйЗаказ = СоздатьЗаказНаПроизводство(
		СлучайныйДень,
		ВыбранноеИзделие.Изделие,
		ВыбранноеИзделие.Спецификация,
		КоличествоИзделий
		);
		
		Если СозданныйЗаказ <> Неопределено Тогда
			СозданныеЗаказы.Добавить(СозданныйЗаказ);
			
			// Добавляем строку в таблицу результатов
			НоваяСтрока = Объект.ТЧРезультат.Добавить();
			НоваяСтрока.НомерЗаказа = СозданныйЗаказ.Номер;
			НоваяСтрока.ДатаЗаказа = СозданныйЗаказ.Дата;
			НоваяСтрока.Изделие = ВыбранноеИзделие.Наименование;
			НоваяСтрока.Количество = КоличествоИзделий;
			НоваяСтрока.Статус = "Создан";
		КонецЕсли;
	КонецЦикла;
	
	// Если нужно, создаем документ закупки
	Если Объект.АвтоСозданиеЗакупки И СозданныеЗаказы.Количество() > 0 Тогда
		СформироватьЗакупкуПоЗаказам(СозданныеЗаказы);
	КонецЕсли;
	
	// Если нужно, оформляем выпуск
	Если Объект.АвтоСозданиеВыпуска И СозданныеЗаказы.Количество() > 0 Тогда
		ОформитьВыпускПоЗаказам(СозданныеЗаказы);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция СоздатьЗаказНаПроизводство(ДатаЗаказа, Изделие, Спецификация, Количество)
	Попытка
		Заказ = Документы.Заказ.СоздатьДокумент();
		Заказ.Дата = ДатаЗаказа;
		
		// Заполняем шапку
		//Заказ.Комментарий = "Создано автоматически генератором заказов";
		
		// Заполняем табличную часть
		НоваяСтрока = Заказ.СписокИзделий.Добавить();
		НоваяСтрока.Номенклатура = Изделие;
		НоваяСтрока.Количество = Количество;
		НоваяСтрока.Спецификации = Спецификация;
		
		// Пытаемся найти единицу измерения
		Попытка
			НоваяСтрока.ЕдиницаИзмерения = Изделие.Единица_измерения;
		Исключение
			// Если нет - оставляем пустым
		КонецПопытки;
		
		Заказ.Записать(РежимЗаписиДокумента.Проведение);
		
		Возврат Заказ;
	Исключение
		Сообщить("Ошибка создания заказа: " + ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
КонецФункции

&НаСервере
Процедура СформироватьЗакупкуПоЗаказам(МассивЗаказов)
	Если МассивЗаказов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Находим минимальную дату среди заказов
	МинимальнаяДата = ТекущаяДата();
	Для Каждого Заказ Из МассивЗаказов Цикл
		Если Заказ.Дата < МинимальнаяДата Тогда
			МинимальнаяДата = Заказ.Дата;
		КонецЕсли;
	КонецЦикла;
	
	ДатаЗакупки = МинимальнаяДата - 86400; // День ранее
	
	// Собираем все материалы из заказов - ИСПРАВЛЕННЫЙ ЗАПРОС
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|   СпецификацииМатериалы.Материал КАК Материал,
	|   СУММА(СпецификацииМатериалы.Количество * ЗаказыСписок.Количество) КАК ОбщееКоличество,
	|   СпецификацииМатериалы.Единица_Измерения КАК ЕдиницаИзмерения
	|ИЗ
	|   Документ.Заказ КАК Заказ
	|       ЛЕВОЕ СОЕДИНЕНИЕ Документ.Заказ.СписокИзделий КАК ЗаказыСписок
	|           ПО Заказ.Ссылка = ЗаказыСписок.Ссылка
	|       ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Спецификации.Материалы КАК СпецификацииМатериалы
	|           ПО ЗаказыСписок.Спецификации = СпецификацииМатериалы.Ссылка
	|ГДЕ
	|   Заказ.Ссылка В (&МассивЗаказов)
	|
	|СГРУППИРОВАТЬ ПО
	|   СпецификацииМатериалы.Материал,
	|   СпецификацииМатериалы.Единица_Измерения";
	
	// Преобразуем массив ссылок в массив значений для запроса
	МассивСсылок = Новый Массив;
	Для Каждого Заказ Из МассивЗаказов Цикл
		МассивСсылок.Добавить(Заказ.Ссылка);
	КонецЦикла;
	
	Запрос.УстановитьПараметр("МассивЗаказов", МассивСсылок);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	// Проверяем, есть ли материалы для закупки
	Если Не Выборка.Следующий() Тогда
		Сообщить("Нет материалов для закупки");
		Возврат;
	КонецЕсли;
	
	// Создаем документ закупки
	ДокЗакупка = Документы.Закупка.СоздатьДокумент();
	ДокЗакупка.Дата = ДатаЗакупки;
	
	// Добавляем первую строку
	НоваяСтрока = ДокЗакупка.Закупка.Добавить();
	НоваяСтрока.Материал = Выборка.Материал;
	НоваяСтрока.Количество = Выборка.ОбщееКоличество;
	НоваяСтрока.Цена = 100; // Временная цена
	НоваяСтрока.Сумма = НоваяСтрока.Цена * НоваяСтрока.Количество;
	
	// Добавляем остальные строки
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ДокЗакупка.Закупка.Добавить();
		НоваяСтрока.Материал = Выборка.Материал;
		НоваяСтрока.Количество = Выборка.ОбщееКоличество;
		НоваяСтрока.Цена = 100; // Временная цена
		НоваяСтрока.Сумма = НоваяСтрока.Цена * НоваяСтрока.Количество;
	КонецЦикла;
	
	ДокЗакупка.Записать(РежимЗаписиДокумента.Запись);
	Сообщить("Сформирован документ закупки №" + ДокЗакупка.Номер);
КонецПроцедуры

&НаСервере
Процедура ОформитьВыпускПоЗаказам(МассивЗаказов)
	Для Каждого ЭлементМассива Из МассивЗаказов Цикл
		// Определяем, что у нас в массиве - ссылка или объект
		Если ТипЗнч(ЭлементМассива) = Тип("ДокументСсылка.Заказ") Тогда
			// Это ссылка - получаем объект
			ЗаказОбъект = ЭлементМассива.ПолучитьОбъект();
		ИначеЕсли ТипЗнч(ЭлементМассива) = Тип("ДокументОбъект.Заказ") Тогда
			// Это уже объект
			ЗаказОбъект = ЭлементМассива;
		Иначе
			Сообщить("Неизвестный тип элемента в массиве");
			Продолжить;
		КонецЕсли;
		
		Если ЗаказОбъект = Неопределено Тогда
			Сообщить("Не удалось получить объект заказа");
			Продолжить;
		КонецЕсли;
		
		// Получаем табличную часть
		Для Каждого СтрокаЗаказа Из ЗаказОбъект.СписокИзделий Цикл
			СоздатьДокументВыпуска(
			ЗаказОбъект.Ссылка,
			СтрокаЗаказа.Номенклатура,
			СтрокаЗаказа.Спецификации,
			СтрокаЗаказа.Количество
			);
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура СоздатьДокументВыпуска(Заказ, Изделие, Спецификация, Количество)
	Попытка
		// Создаем документ
		ДокВыпуск = Документы.ВыполениеЭтапаПроизводства.СоздатьДокумент();
		ДокВыпуск.Дата = ТекущаяДата();
		ДокВыпуск.Заказ = Заказ;
		ДокВыпуск.Номенклатура = Изделие;
		ДокВыпуск.Количество = Количество;
		ДокВыпуск.Статус = Перечисления.СтатусЭтапаПроизводства.Завершен;
		
		// НЕ проводим документ (чтобы человек проверил)
		// Запись будет без проведения
		
		// Получаем материалы из спецификации
		ЗапросМатериалы = Новый Запрос;
		ЗапросМатериалы.Текст = 
		"ВЫБРАТЬ
		|   СпецМатериалы.Материал,
		|   СпецМатериалы.Количество * &Количество КАК Количество,
		|   СпецМатериалы.Единица_Измерения
		|ИЗ
		|   Справочник.Спецификации.Материалы КАК СпецМатериалы
		|ГДЕ
		|   СпецМатериалы.Ссылка = &Спецификация";
		
		ЗапросМатериалы.УстановитьПараметр("Спецификация", Спецификация);
		ЗапросМатериалы.УстановитьПараметр("Количество", Количество);
		
		РезультатМатериалы = ЗапросМатериалы.Выполнить();
		ВыборкаМатериалы = РезультатМатериалы.Выбрать();
		
		// Заполняем материалы
		Пока ВыборкаМатериалы.Следующий() Цикл
			НоваяСтрока = ДокВыпуск.ЗатраченныеМатериалы.Добавить();
			
			// Материал
			НоваяСтрока.ЗатраченныеМатериалы = ВыборкаМатериалы.Материал;
			
			// Количество
			НоваяСтрока.Количество = ВыборкаМатериалы.Количество;
			
			// Единица измерения (берем из спецификации)
			Попытка
				НоваяСтрока.ЕдиницаИзмерения = ВыборкаМатериалы.Единица_Измерения;
			Исключение
				// Если не получается, пробуем взять из материала
				Попытка
					НоваяСтрока.ЕдиницаИзмерения = ВыборкаМатериалы.Материал.Единица_измерения;
				Исключение
					// Оставляем пустым
				КонецПопытки;
			КонецПопытки;
			
			// Склад оставляем пустым (заполнит человек)
		КонецЦикла;
		
		// Получаем трудозатраты из спецификации
		// Получаем трудозатраты из спецификации
		ЗапросТрудозатраты = Новый Запрос;
		ЗапросТрудозатраты.Текст = 
		"ВЫБРАТЬ
		|   СпецТрудозатраты.ВидРабот,
		|   СпецТрудозатраты.ТребуемоеВремяВыполнения КАК ВремяНаОдно
		|ИЗ
		|   Справочник.Спецификации.ТрудозатратыПоЭтапам КАК СпецТрудозатраты
		|ГДЕ
		|   СпецТрудозатраты.Ссылка = &Спецификация";
		
		ЗапросТрудозатраты.УстановитьПараметр("Спецификация", Спецификация);
		
		РезультатТрудозатраты = ЗапросТрудозатраты.Выполнить();
		ВыборкаТрудозатраты = РезультатТрудозатраты.Выбрать();
		
		// Получаем список всех бригад для случайного выбора
		МассивБригад = ПолучитьВсеБригады();
		
		// Генератор случайных чисел для выбора бригады
		ГСЧ = Новый ГенераторСлучайныхЧисел();
		
		// Заполняем трудозатраты
		Пока ВыборкаТрудозатраты.Следующий() Цикл
			НоваяСтрока = ДокВыпуск.Трудозатраты.Добавить();
			
			// Вид работы
			НоваяСтрока.ВидРаботы = ВыборкаТрудозатраты.ВидРабот;
			
			// Время - берем прямо из спецификации (оно уже в минутах)
			// И умножаем на количество изделий
			ВремяНаОдно = ВыборкаТрудозатраты.ВремяНаОдно;
			ОбщееВремя = ВремяНаОдно * Количество;
			
			// Проверяем на разумные пределы
			Если ОбщееВремя < 1 Тогда ОбщееВремя = 1; КонецЕсли;
			Если ОбщееВремя > 10000 Тогда
				// Если слишком большое, возможно пришло в секундах
				ОбщееВремя = ОбщееВремя / 60;
			КонецЕсли;
			
			НоваяСтрока.Время = ОбщееВремя;
			
			// Выбираем случайную бригаду
			Если МассивБригад.Количество() > 0 Тогда
				СлучайныйИндекс = ГСЧ.СлучайноеЧисло(0, МассивБригад.Количество() - 1);
				НоваяСтрока.Бригада = МассивБригад[СлучайныйИндекс];
			КонецЕсли;
		КонецЦикла;
		
		// Записываем документ БЕЗ проведения
		ДокВыпуск.Записать(РежимЗаписиДокумента.Запись);
		
		Сообщить("Создан документ выпуска №" + ДокВыпуск.Номер + " для заказа " + Заказ.Номер);
	Исключение
		Сообщить("Ошибка создания выпуска: " + ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

&НаСервере
Функция ПолучитьВсеБригады()
	// Получаем все элементы справочника Рабочая_бригада (не группы)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|   Бригада.Ссылка
	|ИЗ
	|   Справочник.Рабочая_бригада КАК Бригада
	|ГДЕ
	|   Бригада.ЭтоГруппа = ЛОЖЬ
	|   И НЕ Бригада.ПометкаУдаления";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	МассивБригад = Новый Массив;
	Пока Выборка.Следующий() Цикл
		МассивБригад.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Возврат МассивБригад;
КонецФункции
